while True:
    a = str(input("Почніть розмову: "))
    if a == "Привіт":
        print(" Привіт, я бот з України!")
    elif a == "Доброго дня":
        print(" Привіт, я бот з України!")
    elif a == "Хай":
        print(" Привіт, я бот з України!")
    else:
        print("Дуже цікаво, але, нажаль, нічого не зрозуміло :( ")
    b = str(input("Спитай як в мене справи  "))
    if b == "Як справи?":
        print("Вчусь програмувати на Python!😎")
    elif b == "Що робиш?":
        print("Вчусь програмувати на Python!😎")
    elif b == "Чим займаєшся?":
        print("Вчусь програмувати на Python!😎")
    else:
        print("Дуже цікаво, але, нажаль, нічого не зрозуміло :( ")
    c = str(input("Спитай щось) "))
    if c == "Фільм":
        print("Судний день, рекомндую😅")
    elif c == "Серіал":
        print("Wendsday, хоч він і задовбав")
    elif c == "Кінотеатр":
        print("Cineama city , тц Мегамол")
    else:
        print("Дуже цікаво, але, нажаль, нічого не зрозуміло :( ")
    v = str(input(" Бувай "))
    if v == "Бувай":
        print("Побачимось у мережі, I'll be back.")
        break
    elif v == "Надобраніч":
        print("Побачимось у мережі, I'll be back.")
        break
    elif v == "Гудбай ":
        print("Побачимось у мережі, I'll be back.")
        break
    else:
        print("Дуже цікаво, але, нажаль, нічого не зрозуміло :( ")
        break
