def triangle():
    a = float(input("Введіть довжину першої сторони: "))  # Запрошую данні першої сторони
    b = float(input("Введіть довжину другої сторони: "))  # Запрошую данні другої сторони
    c = float(input("Введіть довжину третьої сторони: "))  # Запрошую данні третьої сторони
    if a + b > c and b + c > a and a + c > b:  # Якщо данні відповідають пропорціям , обичслюєм :
        p = (a + b + c) / 2  # пів периметр
        s = pow(p * (p - a) * (p - b) * (p - c), 1 / 2)  # і площу
        answer = (f"Площа трикутника зі сторонами {a}, {b}, {c} складає: {s}")
    else:  # В інакшому випадку вибиваєм текст що данні не коректін
        answer = (f'Трикутник зі сторонами {a}, {b}, {c} існувати не може. И площі у нього також немає :)')
    return answer
answer = triangle()
print(answer)